app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `products`
---
    public function index()
    {
        $orderModel = new OrderModel();
        $productModel = new ProductModel();

        $stats = $orderModel->getOrderStats();
        $stats['total_products'] = $productModel->countAll();