app/Controllers/Admin/Orders.php

    public function index()
    {
        $orderModel = new OrderModel();

        $status = $this->request->getGet('status');

        if ($status && $status !== 'all') {
            $orders = $orderModel->where('order_status', $status)
                                 ->orderBy('created_at', 'DESC')
                                 ->findAll();
        } else {
            $orders = $orderModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `orders`
WHERE `order_status` = 'cancelled'
ORDER BY `created_at` DESC
SELECT *
FROM `orders`
ORDER BY `created_at` DESC

    public function view($id)
    {
        $orderModel = new OrderModel();
        $orderItemModel = new OrderItemModel();

        $order = $orderModel->find($id);
---
SELECT *
FROM `orders`
WHERE `orders`.`id` = '2'