app/Controllers/Admin/Products.php

SELECT *
FROM `products`
ORDER BY `category` ASC, `name` ASC
---
    public function index()
    {
        $productModel = new ProductModel();
        $products = $productModel->orderBy('category', 'ASC')->orderBy('name', 'ASC')->findAll();