app/Models/OrderModel.php

SELECT COUNT(*) AS `numrows` FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE DATE(created_at) = '2026-02-11'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE DATE(created_at) = '2026-02-11'
AND `order_status` = 'pending'
SELECT SUM(`total_amount`) AS `total_amount`
FROM `orders`
WHERE `order_status` != 'cancelled'
---
    public function getOrderStats()
    {
        $db = \Config\Database::connect();

        $totalOrders = $this->countAll();
        $todayOrders = $this->where('DATE(created_at)', date('Y-m-d'))->countAllResults(false);
        $pendingOrders = $this->where('order_status', 'pending')->countAllResults(false);

        $totalRevenue = $db->table('orders')
                          ->selectSum('total_amount')
                          ->where('order_status !=', 'cancelled')
                          ->get()->getRow()->total_amount ?? 0;