app/Models/OrderItemModel.php

    public function getOrderItems(int $orderId)
    {
        return $this->where('order_id', $orderId)->findAll();
---
SELECT *
FROM `order_items`
WHERE `order_id` = 2