app/Models/ProductModel.php

    public function getAvailableProducts()
    {
        return $this->where('is_available', 1)
                    ->orderBy('category', 'ASC')
                    ->orderBy('name', 'ASC')
                    ->findAll();
---
SELECT *
FROM `products`
WHERE `is_available` = 1
ORDER BY `category` ASC, `name` ASC

    public function getCategories()
    {
        return $this->select('category')
                    ->where('is_available', 1)
                    ->groupBy('category')
                    ->orderBy('category', 'ASC')
                    ->findAll();
---
SELECT `category`
FROM `products`
WHERE `is_available` = 1
GROUP BY `category`
ORDER BY `category` ASC