app/Models/UserModel.php

    public function authenticate(string $username, string $password)
    {
        $user = $this->where('username', $username)
                     ->where('is_active', 1)
                     ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `is_active` = 1
 LIMIT 1